package com.company.lesson7.homework;

//    Напишите программу Java, чтобы получить символ в указанном индексе в строке.
public class CharForIndex {
      public static void main(String[] args) {
        String testString = "Hello World!!";
        char myChar = testString.charAt(4);
        System.out.println(myChar);
    }
}
