package com.company.lesson7.homework;
//Напишите программу Java, чтобы проверить, содержит ли указанная строка указанную последовательность значений символов.

public class someChars {
    public static void main(String[] args) {
        String testString = "testing";
        boolean test = testString.contains("st");
        System.out.println(test);

    }
}
