package com.company.lesson7.homework;
// Напишите программу Java, чтобы проверить, начинается ли заданная строка с содержимым другой строки.
public class startString {
    public static void main(String[] args) {
        String testString = "testing";
        System.out.println(testString.startsWith("test"));
    }
}
